{
    "version": "https://jsonfeed.org/version/1",
    "title": "TORES ORG",
    "description": "",
    "home_page_url": "https://al-kivi.github.io/gh-pages",
    "feed_url": "https://al-kivi.github.io/gh-pages/feed.json",
    "user_comment": "",
    "icon": "https://al-kivi.github.io/gh-pages/media/website/tores-banner.jpg",
    "author": {
        "name": "Al Kivi"
    },
    "items": [
        {
            "id": "https://al-kivi.github.io/gh-pages/how-olivia-chow-can-build-housing-in-toronto.html",
            "url": "https://al-kivi.github.io/gh-pages/how-olivia-chow-can-build-housing-in-toronto.html",
            "title": "How Olivia Chow can build housing in Toronto",
            "summary": "The morning after her election, Olivia Chow committed her first priority as mayor of Toronto is to “cut the red&hellip;",
            "content_html": "<p>The morning after her election, Olivia Chow <a class=\"text-block__link\" oncontextmenu=\"theStarLinkClick(event, this)\" onclick=\"theStarLinkClick(event, this)\" href=\"https://www.youtube.com/watch?v=lSPTbJVxdjQ\">committed</a> her first priority as mayor of Toronto is to “cut the red tape” by immediately approving building permit applications for social and market-rate housing currently stuck at city hall. Fast-tracking housing applications must only be the first step for the mayor-elect when she’s sworn in on July 12.</p>\n<p>To truly tackle the housing supply crisis, there’s Herculean work ahead to scrub the anti-rental philosophy that has dominated city hall for a generation and open the door to a pro-growth vision for Toronto’s future.</p>\n<p>Over the past decade, the number of rental households in Toronto has grown <a class=\"text-block__link\" oncontextmenu=\"theStarLinkClick(event, this)\" onclick=\"theStarLinkClick(event, this)\" href=\"https://www.bildgta.ca/wp-content/uploads/2023/02/Purpose-Built-Rental-Whitepaper-FINAL.pdf\">three times faster</a> than ownership households, while the supply of Purpose-Built Rentals (PBRs) has grown by only <a class=\"text-block__link\" oncontextmenu=\"theStarLinkClick(event, this)\" onclick=\"theStarLinkClick(event, this)\" href=\"https://www.bildgta.ca/wp-content/uploads/2023/02/Purpose-Built-Rental-Whitepaper-FINAL.pdf\">5 per cent</a>. Almost 90 per cent of PBRs in the GTA were built over 40 years ago — before millennials were even born.</p>\n<p>This should come at no surprise to councillors. They’ve gradually accumulated an overwhelming schedule of development charges and regulatory burdens atop PBRs, an approach more resemblant of sin taxes than a housing strategy. Combined with lethargic approval timelines and absurd design guidelines, these units are exceptionally difficult to build.</p>\n<p>Municipal <a class=\"text-block__link\" oncontextmenu=\"theStarLinkClick(event, this)\" onclick=\"theStarLinkClick(event, this)\" href=\"https://canada.constructconnect.com/dcn/news/economic/2022/07/cmhc-report-government-fees-crippling-housing-construction\">development charges</a> are lowest for single family homes (about $35 per square foot), rising to $70 for row houses, $100 for condos and highrise rentals and peaking at $110 for lowrise rentals. In Toronto, PBRs take on average <em>100 months</em> to complete — over 8 years — and at the end of 2022, only <a class=\"text-block__link\" oncontextmenu=\"theStarLinkClick(event, this)\" onclick=\"theStarLinkClick(event, this)\" href=\"https://www.bildgta.ca/wp-content/uploads/2023/02/Purpose-Built-Rental-Whitepaper-FINAL.pdf\">one-third</a> of proposed<strong> </strong>rental projects were approved.</p>\n<p>A recent <a class=\"text-block__link\" oncontextmenu=\"theStarLinkClick(event, this)\" onclick=\"theStarLinkClick(event, this)\" href=\"https://cibccm.com/en/insights/articles/the-week-ahead-time-to-waive-or-defer-hst-on-purpose-built-rentals/\">report</a> from CIBC’s Benjamin Tal found developing a 400-unit condo earns a 12.5 per cent return on average, but that same sized development as a PBR would yield a 20 per cent <em>loss.</em></p>\n<p><span id=\"contentMiddleBreakPoint\"></span></p>\n<p>Urbanation <a class=\"text-block__link\" oncontextmenu=\"theStarLinkClick(event, this)\" onclick=\"theStarLinkClick(event, this)\" href=\"https://www.bildgta.ca/wp-content/uploads/2023/02/Purpose-Built-Rental-Whitepaper-FINAL.pdf\">estimates</a> Toronto needs more than 300,000 new PBRs in the next decade at the low end, for which we’re well off track. Chow’s platform called for a major role for CreateTO to develop social and market housing.</p>\n<p>While this is a welcome ambition, we cannot alone rely on government agencies and public-private partnerships to build things. Look at Housing Now, which has yet to break ground on any of its sites.</p>\n<p>As Mark Richardson from HousingNowTO explained, the City treated “the actual successful delivery of new affordable rental housing units … as an afterthought, as a ‘nice to have,’ as a generally low-priority within the myriad of overlapping and conflicting City Planning priorities and guidelines that exist within City Hall.”<br><br>On the campaign trail and in post-election media hits, Chow has increasingly embraced the leading role that private developers will have to play in tackling the shortage. Attracting investor capital for the housing type Torontonians most desperately need — rentals — requires fundamental reform of the PBR development regime.<br><br>As a coalition builder, Chow can unlock a multi-partisan super-consensus on housing between all levels of government, with new rentals at its heart.<br><br>She should make building rentals more attractive to the private market by reducing development charges for low- and highrise projects, waiving application fees and parkland dedication fees; accelerating permitting timelines by prioritizing PBR applications; increasing height and density limits, especially on smaller lots, and allowing modular construction for highrise PBRs. While Chow has expressed reluctance for strong mayor powers, this authority is well-suited to spur a new generation of private PBR construction in Toronto.<br><br>She will find a welcome ally in Premier Doug Ford’s government, which has already introduced reductions and deferrals on development charges for PBRs, with a higher discount for family-sized units. Together with the province, Chow can lead the charge to call on the federal government to waive or defer HST payments on new PBRs, and lower premiums on rental loan insurance programs — counterproductively raised by the CMHC in April.<br><br>Toronto’s political battle lines are no longer between conservative or progressive values — it’s a contest between growth or stagnation. Mayor-elect Chow has framed her career on connecting with immigrants, young people, and the working class. Now she has an opportunity to ensure they have a home in our city’s future.</p>\n<p> </p>",
            "image": "https://al-kivi.github.io/gh-pages/media/posts/2/man-walking-street.jpg",
            "author": {
                "name": "Al Kivi"
            },
            "tags": [
                   "housing"
            ],
            "date_published": "2023-07-05T21:15:10-04:00",
            "date_modified": "2023-07-05T21:15:10-04:00"
        },
        {
            "id": "https://al-kivi.github.io/gh-pages/hello-there.html",
            "url": "https://al-kivi.github.io/gh-pages/hello-there.html",
            "title": "Mayor Tory Announces Five Point Plan to Get More Houses Built Faster",
            "summary": "From johntory2022.ca – August 23, 2022 Plan aims at addressing the housing shortage and builds on Mayor Tory’s proven track&hellip;",
            "content_html": "<div class=\"entry-content\">\n<p><strong>From johntory2022.ca – August 23, 2022</strong></p>\n<p><em>Plan aims at addressing the housing shortage and builds on Mayor Tory’s proven track record of getting homes built in Toronto</em></p>\n<p>Today Mayor John Tory announced his 2022 re-election campaign policy to help get more homes built in the city and address affordability issues. Canada is facing a national housing shortage, one that is acutely felt in Toronto. When home ownership is out of reach, and rental supply is inadequate, affordability suffers and undermines Toronto’s economic competitiveness. <br><br><em>“We’ve made strong progress over the past eight years to get housing built in Toronto, but to tackle increased affordability challenges brought on by a national housing shortage we need to build more homes, faster,”</em> said Mayor Tory. <em>“I’m proud to announce a five point plan that builds on this progress by looking critically at where we can streamline and modernize processes at City Hall, and how we incentivize our homebuilding partners to increase our housing supply and drive affordability.” <br><br></em><em>“This is about making sure that young people can live and raise their families in the neighbourhoods they grew up in, seniors can stay in their neighbourhoods if they decide to downsize, and newcomers can continue to move to and contribute to this City.”</em> <br><br>The five key pillars of Mayor Tory’s plan include:</p>\n<ol>\n<li>Expanding housing options by permitting “Missing Middle” housing, and allowing greater mid-range density on major roads and in areas served by transit.</li>\n<li>Cutting red tape and speeding up approval times by creating a Development and Growth Division to streamline the process to get more housing built faster.</li>\n<li>Making sure projects move forward and that land that could be used for housing does not sit idle by asking the province to allow the City to enact a “use it or lose it” policy for developers sitting on approved, but undeveloped, land.</li>\n<li>Enabling more co-op, supportive and affordable housing by allocating a portion of City owned land to be developed by non-profits.</li>\n<li>Incentivizing the construction of purpose-built rental housing by reducing fees and charges, as well as prioritizing those applications.</li>\n</ol>\n<p>This plan builds on Mayor Tory’s record of championing pro-housing policies during his two terms as Mayor. In July 2022 alone, the City approved a total of 24,829 housing units, including 2,060 affordable and 2,413 purpose built rental units and 775 rental replacement units.<br><br><em>“Under my leadership over the past eight years Toronto has made strong progress on getting more homes built, especially affordable and supportive housing,”</em> said Mayor Tory. <em>“But there’s more work to do. I believe building on progress we’ve made over the past eight years, in conjunction with actioning these policy proposals, will get more homes built in our city, faster.”</em>  <br><br><em>“The Building Industry and Land Development Association (BILD) supports initiatives to make approvals more timely and efficient, as well as steps to make it easier to build housing of all types”</em>, said <strong>Dave Wilkes, President and CEO of BILD</strong>. <em>“This will help ensure we are able to build more homes for our City’s growing population, faster. Increasing housing supply and creating a more affordable city  requires big thinking and bold action and we look forward to working with Mayor Tory to address this generational challenge.”</em></p>\n<p><em>“We need steady leadership at City Hall to keep up the progress we have made over the last eight years,”</em> said <strong>Ana Bailão, Deputy Mayor and Chair for the Planning and Housing Committee</strong>. “<em>There have been scores of housing achievements in the last term. These accomplishments were possible thanks to the Mayor’s determination at City Hall and thanks to working with our federal and provincial partners. But there is much more work to do and that’s why we need to re-elect the Mayor to build more housing faster in Toronto.” </em></p>\n<p><em>“We need to get more housing built, including more affordable and supportive housing, as well as housing that is attainable for the middle class. And we need to get it built as soon as possible,”</em> said <strong>Brad Bradford, Councillor and candidate for Ward 19 Beaches–East York</strong>. <em>“The best way to drive affordability is to increase our housing supply and that means more housing of every type. The Mayor’s five point plan does just that.”</em></p>\n</div>",
            "image": "https://al-kivi.github.io/gh-pages/media/posts/1/tory-five-point-plan-2.jpg",
            "author": {
                "name": "Al Kivi"
            },
            "tags": [
                   "housing"
            ],
            "date_published": "2023-07-05T10:05:51-04:00",
            "date_modified": "2023-07-05T10:58:11-04:00"
        }
    ]
}
